ERP DEV.WMS/src/InformationRegisters/вмс_ЗаблокированныеЯчейки/вмс_ЗаблокированныеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЗаблокированныеЯчейки</name>
  <resources>
    <name>ВидБлокировки</name>
    <type>
      <types>EnumRef.вмс_ВидыБлокировокЯчеек</types>
    </type>
  </resources>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Enums/вмс_ВидыБлокировокЯчеек/вмс_ВидыБлокировокЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ВидыБлокировокЯчеек</name>
  <enumValues>
    <name>Полная</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/InformationRegisters/вмс_ЗаблокированныеЯчейки/ManagerModule.bsl
Функция СоздатьЗаписиБлокировкиЯчеек(Ячейки, Источник=Неопределено, ВидБлокировки=Неопределено) Экспорт 
		
	Если Не ЗначениеЗаполнено(Ячейки) ИЛИ ТипЗнч(Ячейки) <> Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВидБлокировки = Неопределено Тогда
		ВидБлокировки = Перечисления.вмс_ВидыБлокировокЯчеек.Полная;
	ИначеЕсли ТипЗнч(ВидБлокировки) = Тип("Строка") Тогда
		ВидБлокировки = Перечисления.вмс_ВидыБлокировокЯчеек[ВидБлокировки];
	КонецЕсли;
	
	Для Каждого Ячейка Из Ячейки Цикл	
		МенеджерЗаписи = РегистрыСведений.вмс_ЗаблокированныеЯчейки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Заполнить(Неопределено);
		МенеджерЗаписи.Источник = Источник;
		МенеджерЗаписи.Ячейка = Ячейка;
		МенеджерЗаписи.ВидБлокировки = ВидБлокировки;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецФункции

Функция УдалитьЗаписиБлокировкиЯчеек(Ячейки, Источник=Неопределено) Экспорт 
		
	Если Не ЗначениеЗаполнено(Ячейки) ИЛИ ТипЗнч(Ячейки) <> Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вмс_ЗаблокированныеЯчейки.Ячейка КАК Ячейка
	               |ИЗ
	               |	РегистрСведений.вмс_ЗаблокированныеЯчейки КАК вмс_ЗаблокированныеЯчейки
	               |ГДЕ
	               |	вмс_ЗаблокированныеЯчейки.Ячейка В(&Ячейки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вмс_ЗаблокированныеЯчейки.Ячейка";
	Запрос.УстановитьПараметр("Ячейки", Ячейки);
	Таблица = Запрос.Выполнить().Выгрузить(); 
	ЯчейкиДляРазблокировки = Таблица.ВыгрузитьКолонку("Ячейка");
		
	Для Каждого Ячейка Из ЯчейкиДляРазблокировки Цикл		
		Набор = РегистрыСведений.вмс_ЗаблокированныеЯчейки.СоздатьНаборЗаписей();
		Набор.Заполнить(Неопределено);
		Набор.Отбор.Ячейка.Установить(Ячейка);
		Если Источник <> Неопределено Тогда
			Набор.Отбор.Источник.Установить(Источник);	
		КонецЕсли;
		Набор.Записать();
	КонецЦикла;
	
КонецФункции

Функция УдалитьЗаписиБлокировкиЯчеекПоИсточнику(Источник) Экспорт 
	
	Набор = РегистрыСведений.вмс_ЗаблокированныеЯчейки.СоздатьНаборЗаписей();
	Набор.Заполнить(Неопределено);
	Набор.Отбор.Источник.Установить(Источник);	
	Набор.Записать();
	
КонецФункции
